
--===========================Задание 1=============================--
SELECT Н_ТИПЫ_ВЕДОМОСТЕЙ.НАИМЕНОВАНИЕ, Н_ВЕДОМОСТИ.ИД
    FROM Н_ТИПЫ_ВЕДОМОСТЕЙ
    INNER JOIN Н_ВЕДОМОСТИ ON Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД = Н_ВЕДОМОСТИ.ТВ_ИД
    WHERE Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД = 1. AND Н_ВЕДОМОСТИ.ИД > 1250981;
--===========================Задание 2=============================--
SELECT Н_ЛЮДИ.ФАМИЛИЯ, Н_ОБУЧЕНИЯ.НЗК, Н_УЧЕНИКИ.ИД
    FROM Н_ЛЮДИ
    RIGHT JOIN Н_ОБУЧЕНИЯ
    ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
    RIGHT JOIN Н_УЧЕНИКИ
    ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
    WHERE Н_ЛЮДИ.ИД > 100865 AND Н_ОБУЧЕНИЯ.НЗК::integer > 933232 AND Н_УЧЕНИКИ.ГРУППА::integer > 4100;
 --===========================Задание 3=============================--
 SELECT COUNT(*)
FROM (
SELECT Н_ДИСЦИПЛИНЫ.НАИМЕНОВАНИЕ
      FROM Н_ДИСЦИПЛИНЫ
      GROUP BY Н_ДИСЦИПЛИНЫ.НАИМЕНОВАНИЕ);
 --===========================Задание 4=============================--
SELECT Н_УЧЕНИКИ.ГРУППА
FROM Н_УЧЕНИКИ
WHERE Н_УЧЕНИКИ.ПЛАН_ИД IN (
    SELECT Н_ПЛАНЫ.ИД
    FROM Н_ПЛАНЫ
    WHERE Н_ПЛАНЫ.ОТД_ИД_ЗАКРЕПЛЕН_ЗА = (
        SELECT Н_ОТДЕЛЫ.ИД
        FROM Н_ОТДЕЛЫ
        WHERE Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'ВТ'
    )
      AND Н_ПЛАНЫ.УЧЕБНЫЙ_ГОД = '2011/2012' or Н_ПЛАНЫ.УЧЕБНЫЙ_ГОД = '2010/2011'
)
GROUP BY Н_УЧЕНИКИ.ГРУППА
HAVING COUNT(*) = 10;
 --===========================Задание 5=============================--
 SELECT
    у.ГРУППА AS Группа,
    ROUND(AVG(EXTRACT(YEAR FROM AGE(current_date, л.ДАТА_РОЖДЕНИЯ))), 2) AS Средний_возраст
FROM Н_ЛЮДИ л
         JOIN Н_ОБУЧЕНИЯ о ON л.ИД = о.ЧЛВК_ИД
         JOIN Н_УЧЕНИКИ у ON о.ЧЛВК_ИД = у.ЧЛВК_ИД
WHERE л.ДАТА_РОЖДЕНИЯ IS NOT NULL
GROUP BY у.ГРУППА
HAVING AVG(EXTRACT(YEAR FROM AGE(current_date, л.ДАТА_РОЖДЕНИЯ))) = (
    SELECT MIN(EXTRACT(YEAR FROM AGE(current_date, л2.ДАТА_РОЖДЕНИЯ)))
    FROM Н_ЛЮДИ л2
             JOIN Н_ОБУЧЕНИЯ о2 ON л2.ИД = о2.ЧЛВК_ИД
             JOIN Н_УЧЕНИКИ у2 ON о2.ЧЛВК_ИД = у2.ЧЛВК_ИД
    WHERE у2.ГРУППА = '3100'
);
--===========================Задание 6=============================--
SELECT
    у.ГРУППА,
    л.ФАМИЛИЯ,
    л.ИМЯ,
    л.ОТЧЕСТВО,
    у.ИД,
    ф.НАИМЕНОВАНИЕ,
    у.СОСТОЯНИЕ


FROM Н_ЛЮДИ л
         JOIN Н_ОБУЧЕНИЯ о ON л.ИД = о.ЧЛВК_ИД
         JOIN Н_УЧЕНИКИ у ON о.ЧЛВК_ИД = у.ЧЛВК_ИД
         JOIN Н_ПЛАНЫ п ON у.ПЛАН_ИД = п.ИД
         JOIN Н_ФОРМЫ_ОБУЧЕНИЯ ф ON п.ФО_ИД = ф.ИД

WHERE ф.НАИМЕНОВАНИЕ = 'Очная'
  AND п.КУРС = 1
  AND у.НАЧАЛО = '2011-09-01 00:00:00.000000';
  --===========================Задание 7=============================--
SELECT distinct
    л1.ФАМИЛИЯ AS Фамилия_1,
    л1.ИМЯ AS Имя_1,
    л1.ОТЧЕСТВО AS Отчество1,
    л2.ОТЧЕСТВО AS Отчество2,
    л1.ИД AS ИД_1,
    л2.ФАМИЛИЯ AS Фамилия_2,
    л2.ИМЯ AS Имя_2,
    л2.ИД AS ИД_2
FROM Н_ЛЮДИ л1
         JOIN Н_ОБУЧЕНИЯ о1 ON л1.ИД = о1.ЧЛВК_ИД
         JOIN Н_УЧЕНИКИ у1 ON о1.ЧЛВК_ИД = у1.ЧЛВК_ИД
         JOIN Н_ЛЮДИ л2 ON л1.ОТЧЕСТВО = л2.ОТЧЕСТВО AND л1.ИД != л2.ИД
         JOIN Н_ОБУЧЕНИЯ о2 ON л2.ИД = о2.ЧЛВК_ИД
         JOIN Н_УЧЕНИКИ у2 ON о2.ЧЛВК_ИД = у2.ЧЛВК_ИД
WHERE л1.ОТЧЕСТВО IS NOT NULL and л2.ОТЧЕСТВО != '.'
ORDER BY л1.ОТЧЕСТВО, л1.ФАМИЛИЯ, л1.ИМЯ, л2.ФАМИЛИЯ, л2.ИМЯ;
